In [49]:
import pandas as pd
import numpy as np

1.Load the titanic dataset

In [50]:
df=pd.read_csv('/content/titanic_dataset.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

2. Make ‘PassengerId’ as the index column

In [51]:
df.set_index('PassengerId')

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

3.Basic details of the dataset

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [53]:
df.shape

(891, 12)

In [54]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [55]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [56]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

4.missing value handling

In [57]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [58]:
age_med=df['Age'].median()
age_med

28.0

In [59]:
df['Age'] = df['Age'].fillna(age_med)

In [60]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [61]:
df['Cabin'] = df['Cabin'].fillna("missing")

In [62]:
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       2
dtype: int64

In [63]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [64]:
df['Embarked'] = df['Embarked'].fillna("S")

In [65]:
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

5. Check and handle outliers in at least 3 columns in the dataset

In [66]:
def find_skewed_boundaries(df, variable, distance):
    IQR = df[variable].quantile(0.75) - df[variable].quantile(0.25)

    lower_boundary = df[variable].quantile(0.25) - (IQR * distance)
    upper_boundary = df[variable].quantile(0.75) + (IQR * distance)

    return upper_boundary, lower_boundary

In [67]:
def find_normal_boundaries(df, variable, distance):
    upper_boundary = df[variable].mean() + distance * df[variable].std()
    lower_boundary = df[variable].mean() - distance * df[variable].std()

    return upper_boundary, lower_boundary

In [68]:
# limits for age

age_upper_limit, age_lower_limit = find_normal_boundaries(df, 'Age', 3)
age_upper_limit, age_lower_limit

(68.42067214450209, -9.697507161337114)

In [69]:
# limits for Survived 

Survived_upper_limit, Survived_lower_limit = find_normal_boundaries(df, 'Survived', 3)
Survived_upper_limit, Survived_lower_limit

(1.8436157466329564, -1.0759389789561886)

In [71]:
# limits for Ticket

PassengerId_upper_limit, PassengerId_lower_limit = find_normal_boundaries(df, 'PassengerId', 3)
PassengerId_upper_limit, PassengerId_lower_limit

(1218.0615260456902, -326.06152604569024)

In [72]:
# replace the outliers by the maximum and minimum limit

df['Age']= np.where(df['Age'] > age_upper_limit, age_upper_limit,
                       np.where(df['Age'] < age_lower_limit, age_lower_limit, df['Age']))

In [73]:
df['Survived']= np.where(df['Survived'] > Survived_upper_limit, Survived_upper_limit,
                       np.where(df['Survived'] < Survived_lower_limit, Survived_lower_limit, df['Survived']))

6. Minmax scaling

In [74]:
from sklearn.preprocessing import MinMaxScaler
scaler=MinMaxScaler()

In [75]:
scaled_values=scaler.fit_transform(df[['Pclass', 'Age', 'SibSp', 'Parch','Fare']])
scaled_dataset=pd.DataFrame(scaled_values,columns=['Pclass', 'Age', 'SibSp', 'Parch','Fare'])
scaled_dataset

     Pclass       Age  SibSp     Parch      Fare
0       1.0  0.317350  0.125  0.000000  0.014151
1       0.0  0.552642  0.125  0.000000  0.139136
2       1.0  0.376173  0.000  0.000000  0.015469
3       0.0  0.508524  0.125  0.000000  0.103644
4       1.0  0.508524  0.000  0.000000  0.015713
..      ...       ...    ...       ...       ...
886     0.5  0.390878  0.000  0.000000  0.025374
887     0.0  0.273233  0.000  0.000000  0.058556
888     1.0  0.405584  0.125  0.333333  0.045771
889     0.0  0.376173  0.000  0.000000  0.058556
890     1.0  0.464407  0.000  0.000000  0.015127

[891 rows x 5 columns]

In [76]:
scaled_dataset.describe()

           Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  891.000000  891.000000  891.000000
mean     0.654321    0.425153    0.065376    0.063599    0.062858
std      0.418036    0.189973    0.137843    0.134343    0.096995
min      0.000000    0.000000    0.000000    0.000000    0.000000
25%      0.500000    0.317350    0.000000    0.000000    0.015440
50%      1.000000    0.405584    0.000000    0.000000    0.028213
75%      1.000000    0.508524    0.125000    0.000000    0.060508
max      1.000000    1.000000    1.000000    1.000000    1.000000